src/cf/Documents/ТестовыйДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ТестовыйДокумент</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ТестовыйРБ1</xr:Item>
				<xr:Item>AccumulationRegister.ТестовыйРНОбороты</xr:Item>
				<xr:Item>CalculationRegister.ТестовыйРегистрРасчета</xr:Item>
				<xr:Item>AccumulationRegister.ТестовыйРНОстатки</xr:Item>
				<xr:Item>AccountingRegister.ТестовыйРБ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОбъектов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СтоимостьТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТестовыйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ТестовыйДокумент/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ХранилищеНастроек.Получить();
	
	тр = Новый Структура("Организация", "ГАЛС");
	тр["Организация"] = 1; 
	
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыОбъектовСрезПоследних.Объект.Код КАК Объект,
		|	СтатусыОбъектовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыОбъектов.СрезПоследних(&Период, Объект = &Объект) КАК СтатусыОбъектовСрезПоследних
		|ГДЕ
		|	СтатусыОбъектовСрезПоследних.Статус = &СтатусДействующий";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("СтатусДействующий", "Действущий");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

// Выбранное значение - Массив из СправочникСсылка.Номенклатура
// У Номенклатуры есть реквизит Вид - Строка, принимает значения "Услуга", "Товар"

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого Товар Из ВыбранноеЗначение Цикл	
		Если ПолучитьВидНоменклатуры(Товар) = "Услуга" Тогда		
			Продолжить;	
		КонецЕсли;
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Товар = Товар;
		НоваяСтрока.Стоимость = ПолучитьСтоимостьТовараИзНакладной(Товар);
		НоваяСтрока.Количество = 1;
	КонецЦикла;
	
	Сообщить("Подбор товара завершен");

КонецПроцедуры

&НаСервере
Функция ПолучитьВидНоменклатуры(Номенклатура)
	Возврат Номенклатура.Вид;
КонецФункции // ()

// РС СтоимостьТоваров - независимый, непериодический
// Измерения:
//		- Товар - СправочникСсылка.Номенклатура
//		- ДокументПоступления - ДокументСсылка
// Ресурсы:
//		- Стоимость - число
&НаСервере
Функция ПолучитьСтоимостьТовараИзНакладной(Номенклатура)
	
	Набор = РегистрыСведений.СтоимостьТоваров.СоздатьНаборЗаписей();
	Набор.Отбор.Товар.Установить(Номенклатура);
	Набор.Прочитать();
	
	Возврат Набор[0].Стоимость; 
	
КонецФункции // ()




&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Отказ = Истина;
		Сообщить("Ответственный не заполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтветственного(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Сообщить("Ответственный уже заполнен");
		Возврат;
	КонецЕсли;

	Объект.Ответственный = "Гендрик";
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПоСкладу(Команда)
		
КонецПроцедуры
